#### IPipeFittingAndAccessoryPressureDropServer Members

---

|  |
| --- |
| IPipeFittingAndAccessoryPressureDropServer Interface   Methods   See Also |

The  IPipeFittingAndAccessoryPressureDropServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Calculate | Calculate the pipe fitting and pipe accessory coefficient. |
| Public method | GetDataSchema | Obtains the schema of the ESEntity. |
| Public method | GetDescription | Implement this method to return a description of the server. (Inherited from  IExternalServer  .) |
| Public method | GetName | Implement this method to return the name of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServerId | Implement this method to return the id of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServiceId | Implement this method to return the id of the service. (Inherited from  IExternalServer  .) |
| Public method | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from  IExternalServer  .) |
| Public method | IsApplicable | Check if the server is applicable for the pipe fitting or pipe accessory. |

# See Also

IPipeFittingAndAccessoryPressureDropServer Interface

Autodesk.Revit.DB.Plumbing Namespace